In [1]:
## PANDAS

In [2]:
### 외부 라이브러리 설치
!pip install panda # 이렇게 하면 명령프롬프트에 안가고 여기서도 설치됨. 그러나 명령프롬프트에 익숙해져야 함(리눅스 환경등이 많아...)

ERROR: Invalid requirement: '#'

[notice] A new release of pip available: 22.3.1 -> 23.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
## 라이브러리 로드
import pandas as pd # file 을 새로 열면 반드시 항상 다시 실행해줘야 함. 그렇지 않으면 file 다시 열었을 때 pandas 라이브러리 실행 안됨

In [4]:
## 스리즈의 형태
## pd.Series() 의 형태로 호출하여 만들어 줌 , 항상 value 가 먼저이고 두번째가 index 임
pd_list = pd.Series(
    [5000, 6000, 6500, 6500],   # 첫번째라 value 이고
    ["아메리카노", "카페라테", "카페모카", "카푸치노"] # 두번째라 index 가 됨
)

In [5]:
print(pd_list)

아메리카노    5000
카페라테     6000
카페모카     6500
카푸치노     6500
dtype: int64

In [6]:
## value 와 index 값을 따로 출력 가능함
print("스리즈의 values = ", pd_list.values)
print("스리즈의 index = ", pd_list.index)

스리즈의 values =  [5000 6000 6500 6500]
스리즈의 index =  Index(['아메리카노', '카페라테', '카페모카', '카푸치노'], dtype='object')

In [7]:
pd_list.index = [1,2,3,4] # index 의 값을 1,2,3,4 로 바꾼 것임

In [8]:
print(pd_list)

1    5000
2    6000
3    6500
4    6500
dtype: int64

In [9]:
## 데이터프레임 형태의 데이터 생성 pd.DataFrame() 의 형태
values = [[1,2,3], [4,5,6], [7,8,9]]

df = pd.DataFrame(values)

In [10]:
print(df)  # value 값만 지정을 했고 index 와 column 을 지정하지 않았으므로 index 와 column 은 자동 부여

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [11]:
df # 주피터 환경에서는 print 를 안하고 변수만 적어도 출력됨. 데이터 프레임에서는 print 안하는 것이 더 보기 좋음

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [12]:
## index 값을 변경 a, b, c
## column 의 값을 변경 A, B, C
df.index = ["a", "b", "c"]
df.columns = ["A", "B", "C"]

In [13]:
df

   A  B  C
a  1  2  3
b  4  5  6
c  7  8  9

In [14]:
## 딕셔너리 형태의 데이터를 데이터 프레임 형태로 변경가능 함
values = {
    "name" : ["이몽룡", "이방원", "춘향"],
    "age" : [30, 40, 20],
    "phone" : ["01012345678", "01023456789", "01045671234"]
}

In [15]:
df_2 = pd.DataFrame(values) # 딕셔너리의 key 값이 열의 항목이 되며 value 값이 value 값이 되고 index 는 별도 지정이 없으면 자동 지정됨
df_2

  name  age        phone
0  이몽룡   30  01012345678
1  이방원   40  01023456789
2   춘향   20  01045671234

In [16]:
## 상단의 행을 기준으로 출력하는 head() 함수 사용
## 상단부터 n 번까지 출력하는 함수. 외부 data 사용시 data 가 많으므로 data 가 어떻게 생겼는지 몇개로 확인하기 위해 많이 사용함
df_2.head(2) # ()안에 숫자를 안적으면 기본값 5로 진행 됨

  name  age        phone
0  이몽룡   30  01012345678
1  이방원   40  01023456789

In [17]:
df_2.tail(2)

  name  age        phone
1  이방원   40  01023456789
2   춘향   20  01045671234

In [18]:
## 컬럼을 기준으로 출력하는 방법
df_2["name"] # name 을 리스트로 묶으면 데이터 프레임형태로 출력되고 리스트로 묶지 많으면 스리즈의 형태로 출력됨

0    이몽룡
1    이방원
2     춘향
Name: name, dtype: object

In [19]:
## 컬럼을 기준으로 출력하는 방법
df_2[["name","age"]] # name 을 리스트로 묶으면 데이터 프레임형태로 출력되고 리스트로 묶지 많으면 스리즈의 형태로 출력됨

  name  age
0  이몽룡   30
1  이방원   40
2   춘향   20

In [20]:
## 경로 지정 : 절대경로는 절대적인 주소, 상대경로는 상대적인 주소
## 1. 절대 경로
##   - 절대적인 주소 : URL 같은 주소 같은 것, 컴퓨터의 경우 C:/users/administrator/a.txt 와 같이 어떤 폴더 안에 있는 특정 file 을 지정
## 2. 상대 경로
##   - 상대적인 주소 (아래의 3개만 알고있으면 됨)
##   - "./" : 현재 작업중인 폴더
##   - "../" : 상위 폴더로 이동
##   - "./폴더명/" : 하위 폴더로 이동
## 절대경로와 상대경로를 나눈 이유는 절대 경로는 작업환경이 바뀔때(예를 들어 컴퓨터를 바꾸어 작업 등) 마다 주소를 바꿔줘야 할 수 있고 
## 상대경로는 사용환경이 바뀌더라도 편리하게 사용하기 위한 목적

In [21]:
## read_csv(파일의 위치)
## data 폴더에 있는 example.csv 라는 file 을 가지고 오려면...
## 상위폴더로 한번 이동하고 그후 data 하위폴더로 이동하여 파일을 가져와야 함
df = pd.read_csv("./data/example.csv") # 상대 경로로 가져오는 방법. 04.pandas.ipynb 와 data 가 같은 수준의 폴더에 있으므로 하위 폴더로 이동
df2 = pd.read_csv("C:\\Users\\ezen\\Documents\\GitHub\\nuguli\\data\\example.csv") # 가져오고자 하는 file 에 우클릭하여 주소 복사해서 붙이면 되는데 파이썬은 역슬러시를 두개로 만들어줘야 함

In [22]:
df

  Name  Gender          Phone
0    A    male  010-1234-5678
1    B  female  010-1234-5679
2    C    male  010-1234-5680
3    D  female  010-1234-5681
4    E    male  010-1234-5682
5    F  female  010-1234-5683
6    G    male  010-1234-5684
7    H  female  010-1234-5685
8    I    male  010-1234-5686
9    J  female  010-1234-5687

In [23]:
## 상대 경로로 csv 폴더 안에 num_2 폴더에 있는 drinks.csv 를 로드 해봐라
df3 = pd.read_csv("../csv/drinks.csv") # 실행시키는 것은 data 를 넣기만 하는 것이라 아무것도 안나와야 됨.
                                       # 안될 때는 같은 구역에 있는지 파일 탐색기를 활용해 점검해봐야 함

In [24]:
df3

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

In [25]:
## 결측치
import numpy as np

In [26]:
s1 = pd.Series([1, np.nan, 3, 4, 5]) # np.nan 이 결측치 를 예를 들어 표시한 것임..data 가 없는 것도 결측치
s2 = pd.Series([1, 2, np.nan, 4, 5])
s3 = pd.Series([1, 2, 3, np.nan, 5])

In [27]:
# Series 형태의 데이터를 데이터 프레임으로 합치는 작업
df = pd.DataFrame({
     "S1" : s1,
     "S2" : s2,
     "S3" : s3
})

In [28]:
df # 실행하면 나오는 NaN 이 결측치 임

    S1   S2   S3
0  1.0  1.0  1.0
1  NaN  2.0  2.0
2  3.0  NaN  3.0
3  4.0  4.0  NaN
4  5.0  5.0  5.0

In [29]:
## is() : 값이 존재하는지에 대한 bool 의 형태로 출력을 해주는 함수
## isna() : 결측치를 bool 의 형태로 출력을 해주는 함수. 결측치는 true 로 결측치가 아니면 false 로 나옴
df.isna()

      S1     S2     S3
0  False  False  False
1   True  False  False
2  False   True  False
3  False  False   True
4  False  False  False

In [30]:
df.isna().sum() # 결측치의 합을 보여줌

S1    1
S2    1
S3    1
dtype: int64

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   S1      4 non-null      float64
 1   S2      4 non-null      float64
 2   S3      4 non-null      float64
dtypes: float64(3)
memory usage: 248.0 bytes

In [32]:
## 결측치를 제거하는 방법
## dropna(행을 기준으로 할 것인지 열을 기준으로 할 것인지 지정)
## 매개변수 axis 에 0을 대입하면 행을 기준으로 삭제, 1을 대입하면 열을 기준으로 삭제하는 방식
df.dropna(axis=0)

    S1   S2   S3
0  1.0  1.0  1.0
4  5.0  5.0  5.0

In [33]:
df.dropna(axis=1) # 모든 열에 결측치가 있으므로 index 만 남고 열이 다 없어짐

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [34]:
df.dropna(axis=0,inplace=True) # 실행했는데 값이 안나오는 것은 data 가 변경되었다는 것..위의 처럼 값이 나오면 아직 data 가 바뀐 것은 아니라는 것

In [35]:
df # 기존 data 가 변경됨

    S1   S2   S3
0  1.0  1.0  1.0
4  5.0  5.0  5.0

In [36]:
df = pd.DataFrame({   # 위에서 df 가 바뀌었기 때문에 기존 df 를 만들기 위해 다시 실행해 줌
     "S1" : s1,
     "S2" : s2,
     "S3" : s3
})

In [37]:
df

    S1   S2   S3
0  1.0  1.0  1.0
1  NaN  2.0  2.0
2  3.0  NaN  3.0
3  4.0  4.0  NaN
4  5.0  5.0  5.0

In [38]:
## 통계 요약 정보
df.describe() # 문자열이나 비어있는 것(결측치) 제외 하고 통계 요약함. 이상치가 있는지 감 잡을 수 있음. 
              # data 받아와서 기본으로 하는 작업 중 하나이며 결측치 확인도 동일

             S1        S2        S3
count  4.000000  4.000000  4.000000
mean   3.250000  3.000000  2.750000
std    1.707825  1.825742  1.707825
min    1.000000  1.000000  1.000000
25%    2.500000  1.750000  1.750000
50%    3.500000  3.000000  2.500000
75%    4.250000  4.250000  3.500000
max    5.000000  5.000000  5.000000